In [1]:
import pandas as pd
import numpy as np
import chardet

In [2]:
df1 = pd.read_csv('Human_essays.csv')
df2= pd.read_csv ('AI_essays.csv')

C:\Users\aceto\AppData\Local\Temp\ipykernel_5788\166095867.py:1: DtypeWarning: Columns (268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312) have mixed types. Specify dtype option on import or set low_memory=False.
  df1 = pd.read_csv('Human_essays.csv')

In [3]:
df1.head(2)

,title,description,essay,authors,source_url,thumbnail_url,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 303,Unnamed: 304,Unnamed: 305,Unnamed: 306,Unnamed: 307,Unnamed: 308,Unnamed: 309,Unnamed: 310,Unnamed: 311,Unnamed: 312
0,Addiction,"Passion stabs, unrequited love hurts and taboo...",Omer Bonne means well; that much is certain. A...,Angela Chen,https://aeon.co//essays/how-far-should-medicin...,https://images.aeonmedia.co/images/4c7d125f-f4...,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Addiction,The fear of missing out haunts our social netw...,Hereâ€™s a test you might enjoy: rate these sc...,Jacob Burak,https://aeon.co//essays/can-we-break-free-from...,https://images.aeonmedia.co/images/1c3abfe6-af...,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df1 = df1.loc[:, ~df1.columns.str.startswith('Unnamed')]

In [5]:
dropped_cols = [ 'authors', 'source_url', 'thumbnail_url']
df1.drop(axis=1, columns= dropped_cols, inplace=True)

dropped_cols2= ['Unnamed: 2', 'Unnamed: 3']
df2.drop(axis= 1, columns= dropped_cols2, inplace=True)

In [6]:
df1.head(2)

,title,description,essay
0,Addiction,"Passion stabs, unrequited love hurts and taboo...",Omer Bonne means well; that much is certain. A...
1,Addiction,The fear of missing out haunts our social netw...,Hereâ€™s a test you might enjoy: rate these sc...

In [7]:
df2.head(2)

             id                                               text
0  6060D28C05B6  Some schools in United States ofter classes fr...
1  60623DB5DE7A  Four-day work week, a remarkable idea to conse...

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2393 entries, 0 to 2392
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        2314 non-null   object
 1   description  2314 non-null   object
 2   essay        2229 non-null   object
dtypes: object(3)
memory usage: 56.2+ KB

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2421 entries, 0 to 2420
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      2314 non-null   object
 1   text    2314 non-null   object
dtypes: object(2)
memory usage: 38.0+ KB

In [10]:
df1.rename(columns={'essay': 'Human_written'}, inplace=True)
df2.rename(columns={'text': 'AI_generated'}, inplace=True)

# Merge the two DataFrames based on the index (or reset index if needed)
df_new = pd.DataFrame({
    'AI_generated': df2['AI_generated'],
    'Human_written': df1['Human_written']
})

In [11]:
df_new.dropna()

,AI_generated,Human_written
0,Some schools in United States ofter classes fr...,Omer Bonne means well; that much is certain. A...
1,"Four-day work week, a remarkable idea to conse...",Hereâ€™s a test you might enjoy: rate these sc...
2,Students and their families should consider an...,Human beings crave all sorts of things: coffee...
3,Agree you will never grow if something beyond ...,I hear a single voice as I walk up the steps t...
4,I think our character traits are formed by inf...,Hereâ€™s what I remember about the first time ...
...,...,...
2309,In the future first thing i would really like ...,"In 1969, at the height of the French summer, a..."
2310,I agree that changing the school lunch menu to...,One way to avoid disillusionment is to stay at...
2311,Present. A lot people have a busy life and wor...,A rooster crowed at 4am in downtown Mumbai. Wh...
2312,It Has Been Said That First Impressions Are Al...,The day I first flew in the cockpit of an airl...
2313,Disney land is the place I would want to explo...,One of the biggest thrills of my teenage life ...

In [12]:
# Optional: If you want to keep 'title' or 'description'
# combined_df['title'] = df1['title']  # Uncomment to add title
# combined_df['description'] = df1['description']  # Uncomment to add description

# Display the combined DataFrame
print(df_new.head())

                                        AI_generated  \
0  Some schools in United States ofter classes fr...
1  Four-day work week, a remarkable idea to conse...
2  Students and their families should consider an...
3  Agree you will never grow if something beyond ...
4  I think our character traits are formed by inf...

                                       Human_written
0  Omer Bonne means well; that much is certain. A...
1  Hereâ€™s a test you might enjoy: rate these sc...
2  Human beings crave all sorts of things: coffee...
3  I hear a single voice as I walk up the steps t...
4  Hereâ€™s what I remember about the first time ...

In [13]:
print(df_new.isnull().sum())

AI_generated     107
Human_written    192
dtype: int64

In [14]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2421 entries, 0 to 2420
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   AI_generated   2314 non-null   object
 1   Human_written  2229 non-null   object
dtypes: object(2)
memory usage: 38.0+ KB

In [15]:
df_new.head(3)

,AI_generated,Human_written
0,Some schools in United States ofter classes fr...,Omer Bonne means well; that much is certain. A...
1,"Four-day work week, a remarkable idea to conse...",Hereâ€™s a test you might enjoy: rate these sc...
2,Students and their families should consider an...,Human beings crave all sorts of things: coffee...

In [16]:
df_new.tail()

     AI_generated Human_written
2416          NaN           NaN
2417          NaN           NaN
2418          NaN           NaN
2419          NaN           NaN
2420          NaN           NaN

In [17]:
df_new.dropna(inplace=True)

In [18]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2163 entries, 0 to 2313
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   AI_generated   2163 non-null   object
 1   Human_written  2163 non-null   object
dtypes: object(2)
memory usage: 50.7+ KB

In [19]:
df_ai = pd.DataFrame({
    'text': df_new['AI_generated'],'AI_generated': 1})
df_human = pd.DataFrame({'text': df_new['Human_written'],'AI_generated': 0})
df_new = pd.concat([df_ai, df_human])

In [21]:
df_new.head(6)

                                                text  AI_generated
0  Some schools in United States ofter classes fr...             1
1  Four-day work week, a remarkable idea to conse...             1
2  Students and their families should consider an...             1
3  Agree you will never grow if something beyond ...             1
4  I think our character traits are formed by inf...             1
5  Online classes, i think that if students reall...             1